#+TITLE: Valgrind - Perfilador de Memoria
*** Ejemplo 1
   #+BEGIN_SRC C :results verbatim
     #include <stdio.h>
     #include <string.h>

     int main(){
       char str[50]= "hola mundo como va gente";
       printf("before: %s\n", str);

       // completamos 5 caracteres desde str[5] con '.'
       memset(str+5, '.', 5*sizeof(char));
       printf("after: %s\n", str);
     }
   #+END_SRC

   #+RESULTS:
   : before: hola mundo como va gente
   : after: hola ..... como va gente
*** [TODO] Ejemplo 2
    #+BEGIN_SRC C :results verbatim
      #include <stdio.h>
      #include <string.h>

      void printArr(int arr[], int n){
        for (int i=0; i<n; i++)
          printf("%d ", arr[i]);
      }

      int main(){
        int n = 10;
        int arr[n];

        memset(arr, -1, n*sizeof(arr[0]));
        printf("array after memset()\n");
        printArr(arr, n);

        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : array after memset()
    : -1 -1 -1 -1 -1 -1 -1 -1 -1 -1
** Ejemplos

  #+BEGIN_SRC C
  #include <stdio.h>
  #include <string.h>

  int main(){
    const char src[50] = "oaaaaa";
    char dest[50];

    strcpy(dest, "jojo");
    printf("before %s\n", dest);

    memcpy(dest, src, strlen(src)+1);
    printf("after %s\n", dest);

    return 0;
  }
  #+END_SRC

  #+RESULTS:
  | before | jojo   |
  | after  | oaaaaa |
